<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
	<title>MBTI</title>
	<meta charset="UTF-8">
</head>


<body>
	<h1><a href="702htmlstudy.jsp">Sung woo</a></h1>
	<ol>
		<li><a href="702htmlstudy.jsp">나의정보</a></li>
		<li><a href="702htmlstudy.jsp">나의성향</a></li>
		<li><a href="702htmlstudy2.jsp"">Mbti</a></li>
	</ol>
	<%--li는 list로 목록을 나타내며 해당 목록을 구분하기 위해서는 ul을 사용한다.
	ol을 사용하면, 자동으로 리스트의 순서를 써준다. ordered --%>
	
	<h2>Test</h2>

<br>주의초점 - 에너지의 방향 - '대체적'으로 나타나는 특성
<br>외향형 (Extraversion) - 다른 누군가에게 발상,지식이나 감정을 표현함으로써 에너지를 얻는 기질 - 활발하고 행동력있는 타입. 여러 친구와 두루 사귀길 좋아한다. 또한 자신의 생각을 외부로 표출하고 글 쓰는 것보다 말하는 것을 선호하는 편이다.
<br>내향형 (Introversion) - 발상, 지식이나 감정에 대한 자각의 깊이를 늘려감으로써 에너지를 얻는 기질 - 조용하고 신중한 타입. 한두 명의 친구를 깊게 사귀기를 좋아한다. 생각을 표현하기보다는 내면에 담아두고 대체적으로 말하는 것보다 글 쓰는 것을 선호한다.
<br>인식기능 - 선호하는 인식 - '대체적'으로 나타나는 특성
<br>감각형 (Sensing) - 당장 느껴지는 상황이나 감정에 대한 인식을 선호 - 현실적인 타입[1] 숲보다 나무를 본다. 다소 꼼꼼하다. 객관적인 규칙대로 한다. 현재에 충실하며 실용적이다.
<br>직관형 (iNtuition) - 지금 느낀 것을 토대로 연상되는 보다 먼 미래에 나타나는 상황이나 감정에 대한 인식을 선호 - 직관적인 타입. 나무보다 숲을 본다. 다소 두루뭉술하다. 자기만의 방식이 있다. 미래를 추구하며 이상적이다.
<br>판단기능 - 어떤 일 등을 판단할 때 선호하는 방식 [2]- '대체적'으로 나타나는 특성
<br>사고형 (Thinking) - 옳다고 여기는 대로 판단하는것을 선호 - 업무 중심 타입. 대인관계, 사람보다 일, 명분, 그리고 목표를 중시한다. 논리적인 성향이 강하다.
<br>감정형 (Feeling) - 나 또는 집단의 만족을 중점으로 판단하는 것을 선호 - 인간 중심 타입. 일, 목표보다는 대인관계와 사람을 중시한다. 공감적인 성향이 강하다.
<br>생활양식 - 선호하는 삶의 패턴 - '대체적'으로 나타나는 특성
<br>판단형 (Judging) - 결과의 올바름 혹은 만족을 보는 것을 선호 - 질서정연한 타입. 정리하기를 좋아한다. 분류, 계획적이고 판단적인 성향이 강하다.
<br>인식형 (Perceiving) - 과정의 올바름 혹은 만족을 보는 것을 선호 - 융통적인 타입. 편하게 되어 있기를 좋아한다. 자유롭고 즉흥적인 성향이 강하다.

</body>
</html>